import React from 'react';
import './sum.css'

const Sum = () => {
    return (
        <section className='sum'>
            <div className="container">
                <h2 className='sum__title'>Стоимость участия</h2>
                <div className='sum__top'>
                    <div className='sum__tarif'>
                        <div className='sum__tarif-item'>
                            <h3 className='sum__tarif-title'>Базовый (для камчадал)</h3>
                            <p className='sum__tarif-price'>79 000 руб</p>
                        </div>
                        <div className='sum__tarif-item'>
                            <h3 className='sum__tarif-title'>Базовый + проживание</h3>
                            <p className='sum__tarif-price'>99 000 руб</p>
                        </div>
                        <div className='sum__tarif-item'>
                            <h3 className='sum__tarif-title'>Базовый + проживание + долина гейзеров</h3>
                            <p className='sum__tarif-price'>179 000 руб</p>
                        </div>
                    </div>
                    <div className='sum__top-links'>
                        <ul className='sum__top-list'>
                            <li className='sum__top-item'>
                                <a href="" className='sum__top-link'>Информация о бронях</a>
                            </li>
                            <li className='sum__top-item'>
                                <a href="" className='sum__top-link'>Важная информация</a>
                            </li>
                            <li className='sum__top-item'>
                                <a href="" className='sum__top-link'>Условия договора и возврата</a>
                            </li>
                        </ul>
                        <div className='sum__tour'>
                            <a href="#" className='sum__link'>Отправить заявку</a>
                            <div className='sum__circle'>
                                <svg width="34" height="35" viewBox="0 0 34 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <g >
                                        <path d="M24.7744 9.19027C24.774 9.19027 24.7736 9.19021 24.7731 9.19024L17.8622 9.2208C17.3445 9.2231 16.9265 9.64462 16.9288 10.1624C16.9311 10.6802 17.3526 11.0981 17.8704 11.0958L22.5103 11.0753L8.49942 25.1425C8.13403 25.5093 8.13521 26.1029 8.50207 26.4683C8.86893 26.8337 9.4625 26.8325 9.8279 26.4656L23.8388 12.3985L23.8369 17.0384C23.8367 17.5562 24.2563 17.976 24.774 17.9762C25.2919 17.9765 25.7117 17.5568 25.7119 17.0391L25.7148 10.1281C25.7148 10.1277 25.7147 10.1273 25.7148 10.1268C25.7142 9.60808 25.2915 9.18867 24.7744 9.19027Z" fill="black"/>
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_469_7">
                                            <rect width="24" height="24" fill="black" transform="translate(0 18) rotate(-45.1148)"/>
                                        </clipPath>
                                    </defs>
                                </svg>
                            </div>
                        </div>
                    </div>
                </div>
                <div className='sum__bot'>
                    <div className='sum__card'>
                        <h3 className='sum__card-title sum__card-title_first'>
                            <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M16.8726 9.08626L11.3522 14.6068L9.12721 12.3818C9.1272 12.3818 9.12719 12.3818 9.12718 12.3818C8.70259 11.957 8.014 11.957 7.5894 12.3818C7.16458 12.8064 7.16457 13.495 7.58937 13.9196C7.58938 13.9196 7.58939 13.9196 7.5894 13.9196L10.5833 16.9137L10.5834 16.9138C11.0081 17.3383 11.6965 17.3383 12.1213 16.9138L12.1213 16.9137L18.4106 10.6243C18.4106 10.6243 18.4106 10.6243 18.4106 10.6243C18.8354 10.1996 18.8354 9.51102 18.4106 9.08626C17.986 8.66163 17.2974 8.66167 16.8727 9.08623L16.8726 9.08626ZM13 25.15C19.7149 25.15 25.15 19.7158 25.15 13C25.15 6.28508 19.7158 0.85 13 0.85C6.28508 0.85 0.85 6.28415 0.85 13C0.85 19.7149 6.28415 25.15 13 25.15ZM13 3.025C18.5131 3.025 22.975 7.48623 22.975 13C22.975 18.5131 18.5138 22.975 13 22.975C7.48695 22.975 3.025 18.5138 3.025 13C3.025 7.48695 7.48623 3.025 13 3.025Z" fill="#198580" stroke="#198580" />
                            </svg>
                            В стоимость входит
                        </h3>
                        <ul className='sum__card-list'>
                            <li className='sum__card-item'>
                              <span>встреча и проводы в аэропорту</span>
                            </li>
                            <li className='sum__card-item'>
                                  <span>питание: обеды во время экскурсий</span>
                            </li>
                            <li className='sum__card-item'>
                                <span> услуги гида </span>
                            </li>
                            <li className='sum__card-item'>
                                 <span> все транспортные услуги ( автобусы, <br/> джипы-вездеходы 4WD)</span>
                            </li>
                            <li className='sum__card-item'>
                                 <span>все указанные в программе экскурсии</span>
                            </li>
                        </ul>
                    </div>
                    <div className='sum__card'>
                        <h3 className='sum__card-title '>

                                <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M25 13C25 19.633 19.6321 25 13 25C6.367 25 1 19.6321 1 13C1 6.367 6.36792 1 13 1C19.633 1 25 6.36792 25 13ZM23.125 13C23.125 7.40338 18.5959 2.875 13 2.875C7.40338 2.875 2.875 7.40411 2.875 13C2.875 18.5966 7.40411 23.125 13 23.125C18.5966 23.125 23.125 18.5959 23.125 13Z" fill="#212121"/>
                                    <path d="M7.8187 17.0907H9.72783V18.7273C9.72783 18.8069 9.7533 18.8721 9.80456 18.9231C9.85568 18.9744 9.92102 19 10.0006 19H11.4238C11.4977 19 11.5616 18.9744 11.6156 18.9231C11.6696 18.8721 11.6965 18.8069 11.6965 18.7273V17.0907H16.0005C16.0799 17.0907 16.1453 17.0654 16.1965 17.0141C16.2478 16.9629 16.2733 16.8977 16.2733 16.818V15.7271C16.2733 15.6479 16.2478 15.5823 16.1965 15.5313C16.1454 15.4801 16.0799 15.4544 16.0005 15.4544H11.6964V14.4487H14.5941C15.7304 14.4487 16.6578 14.1024 17.3768 13.409C18.0954 12.7162 18.4549 11.8214 18.4549 10.7243C18.4549 9.62805 18.0954 8.73317 17.3768 8.03972C16.658 7.34695 15.7304 7 14.5941 7H10.0005C9.92086 7 9.85565 7.02562 9.80442 7.07659C9.7533 7.12785 9.72768 7.19348 9.72768 7.27266V12.6336H7.8187C7.7391 12.6336 7.67387 12.6605 7.62263 12.7145C7.57154 12.7685 7.5459 12.8324 7.5459 12.9062V14.176C7.5459 14.2556 7.57137 14.3208 7.62263 14.3721C7.67389 14.4234 7.73896 14.4487 7.8187 14.4487H9.72783V15.4544H7.8187C7.7391 15.4544 7.67387 15.48 7.62263 15.5313C7.57154 15.5823 7.5459 15.6478 7.5459 15.7271V16.818C7.5459 16.8977 7.57137 16.9629 7.62263 17.0141C7.67387 17.0654 7.73907 17.0907 7.8187 17.0907ZM11.6964 8.81552H14.4236C15.0258 8.81552 15.5116 8.9916 15.881 9.34386C16.2502 9.69615 16.435 10.1565 16.435 10.7245C16.435 11.2927 16.2502 11.7532 15.881 12.1051C15.5116 12.4577 15.0258 12.6337 14.4236 12.6337H11.6964V8.81552Z" fill="black"/>
                                </svg>

                            За дополнительную плату
                        </h3>
                        <ul className='sum__card-list'>
                            <li className='sum__card-item'>
                              <span>вертолётная экскурсия в Долину Гейзеров и <br/>
                                  кальдеру Узона, оплачивается в день вылета</span>
                            </li>
                            <li className='sum__card-item'>
                                  <span>дополнительные экскурсии и опции</span>
                            </li>
                            <li className='sum__card-item'>
                                <span>размещение в гостинице</span>
                            </li>
                            <li className='sum__card-item'>
                                 <span>питание(кроме обедов во время экскурсий)</span>
                            </li>
                            <li className='sum__card-item'>
                                 <span>личные расходы</span>
                            </li>
                        </ul>
                    </div>
                </div>
            </div>
        </section>
    );
};

export default Sum;